sleuthDisabled.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            44985

Document Path:          /fooNoSleuth
Document Length:        0 bytes

Concurrency Level:      10
Time taken for tests:   7.052 seconds
Complete requests:      3000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      234000 bytes
HTML transferred:       0 bytes
Requests per second:    425.42 [#/sec] (mean)
Time per request:       23.506 [ms] (mean)
Time per request:       2.351 [ms] (mean, across all concurrent requests)
Transfer rate:          32.40 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       3
Processing:     1   22  33.2     12     415
Waiting:        1   22  33.2     12     415
Total:          1   23  33.2     12     415

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     18
  75%     23
  80%     29
  90%     53
  95%     77
  98%    108
  99%    128
 100%    415 (longest request)