sleuthDisabled.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            35531

Document Path:          /fooNoSleuth
Document Length:        0 bytes

Concurrency Level:      10
Time taken for tests:   30.000 seconds
Complete requests:      16010
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      1248780 bytes
HTML transferred:       0 bytes
Requests per second:    533.67 [#/sec] (mean)
Time per request:       18.738 [ms] (mean)
Time per request:       1.874 [ms] (mean, across all concurrent requests)
Transfer rate:          40.65 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0   19  24.4     16     594
Waiting:        0   18  24.0     16     594
Total:          1   19  24.4     16     594

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     20
  75%     22
  80%     24
  90%     29
  95%     33
  98%     41
  99%     50
 100%    594 (longest request)