sleuthOnEach.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            42187

Document Path:          /foo
Document Length:        9 bytes

Concurrency Level:      10
Time taken for tests:   4.340 seconds
Complete requests:      10000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      870000 bytes
HTML transferred:       90000 bytes
Requests per second:    2303.90 [#/sec] (mean)
Time per request:       4.340 [ms] (mean)
Time per request:       0.434 [ms] (mean, across all concurrent requests)
Transfer rate:          195.74 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       6
Processing:     0    4   5.6      2     131
Waiting:        0    4   5.6      2     130
Total:          0    4   5.6      3     131

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      4
  80%      5
  90%      8
  95%     13
  98%     23
  99%     30
 100%    131 (longest request)