sleuthOnEach.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            45949

Document Path:          /foo
Document Length:        0 bytes

Concurrency Level:      10
Time taken for tests:   30.300 seconds
Complete requests:      13990
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      1091220 bytes
HTML transferred:       0 bytes
Requests per second:    461.71 [#/sec] (mean)
Time per request:       21.658 [ms] (mean)
Time per request:       2.166 [ms] (mean, across all concurrent requests)
Transfer rate:          35.17 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       4
Processing:     1   21  25.9     18    1097
Waiting:        0   21  25.8     18    1097
Total:          1   21  25.8     18    1098

Percentage of the requests served within a certain time (ms)
  50%     18
  66%     22
  75%     24
  80%     26
  90%     33
  95%     39
  98%     52
  99%     72
 100%   1098 (longest request)