sleuthOnLast.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            41385

Document Path:          /foo
Document Length:        0 bytes

Concurrency Level:      10
Time taken for tests:   4.500 seconds
Complete requests:      3000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      234000 bytes
HTML transferred:       0 bytes
Requests per second:    666.65 [#/sec] (mean)
Time per request:       15.000 [ms] (mean)
Time per request:       1.500 [ms] (mean, across all concurrent requests)
Transfer rate:          50.78 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     1   14  21.7      9     300
Waiting:        1   14  21.6      9     300
Total:          1   14  21.7      9     300

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     13
  75%     17
  80%     20
  90%     29
  95%     43
  98%     64
  99%     81
 100%    300 (longest request)